# Data Exploration

In this notebook describe your data exploration steps.

## Install dependencies

In [9]:
%pip install pandas
%pip install 'SQLAlchemy==1.4.46'

Requirement already satisfied: pandas in /Users/macjanine/opt/anaconda3/envs/SAKI/lib/python3.11/site-packages (1.5.3)
Requirement already satisfied: python-dateutil>=2.8.1 in /Users/macjanine/opt/anaconda3/envs/SAKI/lib/python3.11/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /Users/macjanine/opt/anaconda3/envs/SAKI/lib/python3.11/site-packages (from pandas) (2022.7)
Requirement already satisfied: numpy>=1.21.0 in /Users/macjanine/opt/anaconda3/envs/SAKI/lib/python3.11/site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in /Users/macjanine/opt/anaconda3/envs/SAKI/lib/python3.11/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.
Requirement already satisfied: SQLAlchemy==1.4.46 in /Users/macjanine/opt/anaconda3/envs/SAKI/lib/python3.11/site-packages (1.4.46)
Requirement already satisfied: greenlet!=0.4.17 in /Users/macjanine/opt/anaconda3/envs/SAKI/lib/python3.11/site-packages (from SQLAlchemy==1.4.46) (2.0.1)
Note: you may need to restart the kernel to use updated packages.

## Assumptions
- Train is delayed if delay is more than 5 Minutes
- Train data consists only of train departures where planned and changeddeparture time is available
- Map of weather data to train station with name because there is (currently) no geo data available from train staions
( Idea: Geographical data analysis https://techlabsdus.medium.com/analysis-of-deutsche-bahn-ag-long-distance-train-traffic-delays-b183aacad9a2
To avoid further work with different API, all longitudes and latitudes for the main train stations were taken from the txt.files from GTFS.de (4.c.) by converting to csv-files and data frames. For a bigger project API’s should be taken into consideration.
)
- Restriction to main stations in germany

## Load data

In [10]:
import pandas as pd

weather_stations= pd.read_sql_table('weather_stations','sqlite:///project/data/amse.sqlite')
weather_stations

,Unnamed: 0,id,name,country,region,identifiers,location,timezone,inventory
0,1227,10004,{'en': 'UFS TW Ems'},DE,HH,"{'national': '01228', 'wmo': '10004', 'icao': ...","{'latitude': 54.1667, 'longitude': 6.35, 'elev...",Europe/Berlin,"{'model': {'start': '2018-01-28', 'end': '2023..."
1,1228,10007,{'en': 'UFS Deutsche Bucht.'},DE,HH,"{'national': '00954', 'wmo': '10007', 'icao': ...","{'latitude': 54.1833, 'longitude': 7.4333, 'el...",Europe/Berlin,"{'model': {'start': '2018-01-28', 'end': '2023..."
2,1229,10008,{'en': 'Nordseeboje 2'},DE,HH,"{'national': '13904', 'wmo': '10008', 'icao': ...","{'latitude': 55.0, 'longitude': 6.3333, 'eleva...",Europe/Berlin,"{'model': {'start': None, 'end': None}, 'hourl..."
3,1230,10015,{'en': 'Helgoland'},DE,SH,"{'national': '02115', 'wmo': '10015', 'icao': ...","{'latitude': 54.1833, 'longitude': 7.9, 'eleva...",Europe/Berlin,"{'model': {'start': '2018-01-28', 'end': '2023..."
4,1231,10018,{'en': 'Westerland / Sylt'},DE,SH,"{'national': None, 'wmo': '10018', 'icao': 'ED...","{'latitude': 54.9167, 'longitude': 8.35, 'elev...",Europe/Berlin,"{'model': {'start': '2018-01-28', 'end': '2023..."
...,...,...,...,...,...,...,...,...,...
1179,15583,XXIO0,"{'en': 'Bretten, Kreis Karlsruhe'}",DE,BW,"{'national': '07490', 'wmo': None, 'icao': None}","{'latitude': 49.0334, 'longitude': 8.7121, 'el...",Europe/Berlin,"{'model': {'start': '2023-05-13', 'end': '2023..."
1180,15589,Y4O2A,{'en': 'Backnang/murr'},DE,BW,"{'national': '07380', 'wmo': None, 'icao': None}","{'latitude': 48.9353, 'longitude': 9.4009, 'el...",Europe/Berlin,"{'model': {'start': '2023-05-13', 'end': '2023..."
1181,15594,YA9TW,"{'en': 'Boll, Bad (kläranl.)'}",DE,BW,"{'national': '05985', 'wmo': None, 'icao': None}","{'latitude': 48.652, 'longitude': 9.6232, 'ele...",Europe/Berlin,"{'model': {'start': '2023-05-14', 'end': '2023..."
1182,15618,YJQ5W,{'en': 'Enzklösterle'},DE,BW,"{'national': '05840', 'wmo': None, 'icao': None}","{'latitude': 48.6671, 'longitude': 8.47, 'elev...",Europe/Berlin,"{'model': {'start': '2023-05-14', 'end': '2023..."
1183,15699,ZVFY7,{'en': 'Entenpfuhl'},DE,RP,"{'national': '14139', 'wmo': None, 'icao': None}","{'latitude': 49.8967, 'longitude': 7.5869, 'el...",Europe/Berlin,"{'model': {'start': '2023-05-13', 'end': '2023..."

In [11]:
weather= pd.read_sql_table('weather','sqlite:///project/data/amse.sqlite')
weather

,date,hour,temp,dwpt,rhum,prcp,snow,wdir,wspd,wpgt,pres,tsun,coco,station
0,2023-01-02,0,13.3,8.4,72.0,NaN,NaN,196.0,27.8,42.6,1012.4,NaN,4.0,10501
1,2023-01-02,1,13.3,8.6,73.0,NaN,NaN,200.0,27.8,44.5,1012.5,NaN,4.0,10501
2,2023-01-02,2,13.2,8.7,74.0,NaN,NaN,200.0,29.6,44.5,1012.5,NaN,4.0,10501
3,2023-01-02,3,13.0,8.9,76.0,NaN,NaN,202.0,29.6,46.3,1012.5,NaN,7.0,10501
4,2023-01-02,4,12.6,8.9,78.0,NaN,NaN,205.0,25.9,44.5,1012.4,NaN,7.0,10501
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
768305,2023-06-06,14,21.1,8.7,45.0,NaN,NaN,19.0,13.0,27.8,1016.1,NaN,2.0,10714
768306,2023-06-06,15,21.1,8.7,45.0,NaN,NaN,22.0,13.0,27.8,1015.9,NaN,2.0,10714
768307,2023-06-06,16,20.8,8.8,46.0,NaN,NaN,17.0,13.0,27.8,1015.8,NaN,2.0,10714
768308,2023-06-06,17,20.5,11.4,56.0,NaN,NaN,291.0,13.0,25.9,1015.5,NaN,3.0,10714
768309,2023-06-06,18,19.6,11.6,60.0,NaN,NaN,303.0,13.0,25.9,1015.6,NaN,3.0,10714

In [12]:
train_stations= pd.read_sql_table('train_stations','sqlite:///project/data/amse.sqlite')
train_stations

,meta,name,eva,ds100,db,creationts,updatets
0,None,Aachen Hbf,8000001,KA,1,23-06-10 10:47:35.561,None
1,None,Aalen Hbf,8000002,TA,1,23-06-10 10:47:35.561,None
2,None,Arnstadt Hbf,8010007,UA,1,23-06-10 10:47:35.980,None
3,None,Aschaffenburg Hbf,8000010,NAH,1,23-06-10 10:47:35.562,None
4,None,Augsburg Hbf,8000013,MA,1,23-06-10 10:47:35.562,None
...,...,...,...,...,...,...,...
193,8089299,Würzburg Hbf,8000260,NWH,1,23-06-10 10:47:35.841,None
194,8000260,Würzburg Hbf (Busbahnhof),8089299,NWH H,1,23-06-10 10:47:36.105,None
195,None,Zweibrücken Hbf,8006680,SZW,1,23-06-10 10:47:36.090,None
196,None,Zwickau(Sachs)Hbf,8010397,DZW,1,23-06-10 10:47:35.722,None
197,None,Öhringen Hbf,8004623,TOE,1,23-06-10 10:47:35.930,None

In [13]:
timetables= pd.read_sql_table('timetables3105','sqlite:///project/data/amse.sqlite')
timetables

           eva                 ct    pt
0      8000001  31.05.2023, 17:45  None
1      8000001  31.05.2023, 20:21  None
2      8000001  31.05.2023, 18:37  None
3      8000001  31.05.2023, 18:37  None
4      8000001  31.05.2023, 19:23  None
...        ...                ...   ...
25468  8004623  31.05.2023, 11:08  None
25469  8004623  31.05.2023, 10:41  None
25470  8004623  31.05.2023, 10:31  None
25471  8004623  31.05.2023, 10:08  None
25472  8004623  31.05.2023, 09:07  None

[25473 rows x 3 columns]

### Look at the first rows

In [14]:
timetables.head(10)

       eva                 ct    pt
0  8000001  31.05.2023, 17:45  None
1  8000001  31.05.2023, 20:21  None
2  8000001  31.05.2023, 18:37  None
3  8000001  31.05.2023, 18:37  None
4  8000001  31.05.2023, 19:23  None
5  8000001  31.05.2023, 18:25  None
6  8000001  31.05.2023, 14:51  None
7  8000001  31.05.2023, 15:56  None
8  8000001  31.05.2023, 18:05  None
9  8000001  31.05.2023, 18:04  None

### Data exploration
Print some basic information about the data. Your data exploration would continue here.

In [15]:
#timetables=timetables.dropna(timetables['pt'])
timetables = timetables[timetables['pt'].notna()]
timetables

           eva                 ct                 pt
349    8000010  31.05.2023, 15:04  31.05.2023, 14:33
461    8000013  31.05.2023, 18:04  31.05.2023, 17:22
462    8000013  31.05.2023, 20:57  31.05.2023, 20:55
523    8000013  31.05.2023, 16:20  31.05.2023, 15:41
532    8000013  31.05.2023, 14:25  31.05.2023, 14:24
...        ...                ...                ...
25360  8010397  31.05.2023, 14:39  31.05.2023, 13:32
25382  8010397  31.05.2023, 13:08  31.05.2023, 12:32
25396  8010397  31.05.2023, 12:23  31.05.2023, 11:32
25398  8010397  31.05.2023, 12:07  31.05.2023, 09:32
25416  8010397  31.05.2023, 09:32  31.05.2023, 08:32

[955 rows x 3 columns]

In [16]:
timetables['ct'].isna().sum()

137

In [17]:
timetables['ct'] = pd.to_datetime(timetables['ct'])
timetables['pt'] = pd.to_datetime(timetables['pt'])

timetables['delay']=timetables['ct']-timetables['pt'] 
timetables

/var/folders/2b/xfhfgtks093fmw0bgw37w21r0000gn/T/ipykernel_29411/3043944084.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  timetables['ct'] = pd.to_datetime(timetables['ct'])
/var/folders/2b/xfhfgtks093fmw0bgw37w21r0000gn/T/ipykernel_29411/3043944084.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  timetables['pt'] = pd.to_datetime(timetables['pt'])
/var/folders/2b/xfhfgtks093fmw0bgw37w21r0000gn/T/ipykernel_29411/3043944084.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  timetables['delay']=timetables['ct']-timetables['pt']

           eva                  ct                  pt           delay
349    8000010 2023-05-31 15:04:00 2023-05-31 14:33:00 0 days 00:31:00
461    8000013 2023-05-31 18:04:00 2023-05-31 17:22:00 0 days 00:42:00
462    8000013 2023-05-31 20:57:00 2023-05-31 20:55:00 0 days 00:02:00
523    8000013 2023-05-31 16:20:00 2023-05-31 15:41:00 0 days 00:39:00
532    8000013 2023-05-31 14:25:00 2023-05-31 14:24:00 0 days 00:01:00
...        ...                 ...                 ...             ...
25360  8010397 2023-05-31 14:39:00 2023-05-31 13:32:00 0 days 01:07:00
25382  8010397 2023-05-31 13:08:00 2023-05-31 12:32:00 0 days 00:36:00
25396  8010397 2023-05-31 12:23:00 2023-05-31 11:32:00 0 days 00:51:00
25398  8010397 2023-05-31 12:07:00 2023-05-31 09:32:00 0 days 02:35:00
25416  8010397 2023-05-31 09:32:00 2023-05-31 08:32:00 0 days 01:00:00

[955 rows x 4 columns]

In [18]:
match_table= pd.read_sql_table('match_table','sqlite:///project/data/amse.sqlite')
match_table

,eva,name_x,common,id,name_y,match
0,8000001,Aachen Hbf,Aachen,10501,{'en': 'Aachen'},1
1,8000001,Aachen Hbf,Aachen,10503,{'en': 'Aachen / Merzbruck'},1
2,8000013,Augsburg Hbf,Augsburg,10852,{'en': 'Augsburg'},1
3,8000028,Bayreuth Hbf,Bayreuth,10677,{'en': 'Bayreuth'},1
4,8000885,Berchtesgaden Hbf,Berchtesgaden,D6190,{'en': 'Berchtesgaden'},1
...,...,...,...,...,...,...
227,8000379,Wittlich Hbf,Wittlich,D5635,{'en': 'Wittlich'},1
228,8006552,Wolfsburg Hbf,Wolfsburg,D5676,{'en': 'Wolfsburg (Südwest)'},1
229,8000257,Worms Hbf,Worms,EDFV0,{'en': 'Worms / Nonnenhof'},1
230,8000266,Wuppertal Hbf,Wuppertal,D5717,{'en': 'Wuppertal-Buchenhofen'},1
231,8006680,Zweibrücken Hbf,Zweibrücken,10714,{'en': 'Zweibrücken Airfield'},1

In [19]:
timetables.info()

#df['Status'].unique()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 955 entries, 349 to 25416
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   eva     955 non-null    int64
 1   ct      818 non-null    datetime64[ns]
 2   pt      955 non-null    datetime64[ns]
 3   delay   818 non-null    timedelta64[ns]
dtypes: datetime64[ns](2), int64(1), timedelta64[ns](1)
memory usage: 37.3 KB

### Plot count of delayed trains at station

### Plot avergare temp per day at station

### Plot correlation between delayed trains and temp

### Plot map of train delays frequencies in germany